book/assets/assessments/terminal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-13 Mon 11:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Terminal Assessment</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Terminal Assessment</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgefe07ac">1. Goal</a></li>
<li><a href="#org8da8abd">2. Tasks</a>
<ul>
<li><a href="#org269bcc0">2.1. Submit a file that answers the following questions:</a>
<ul>
<li><a href="#org13c8ca6">2.1.1. File Requirements</a></li>
</ul>
</li>
<li><a href="#org20d236a">2.2. Submit a file that does the following:</a></li>
<li><a href="#org53fad86">2.3. Last Thoughts</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgefe07ac" class="outline-2">
<h2 id="orgefe07ac"><span class="section-number-2">1.</span> Goal</h2>
<div class="outline-text-2" id="text-1">
<p>
Demonstrate basic knowledge about and usage of the terminal (aka: command line or shell). 
</p>
</div>
</div>

<div id="outline-container-org8da8abd" class="outline-2">
<h2 id="org8da8abd"><span class="section-number-2">2.</span> Tasks</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Note</b> This assessment has two parts and asks for two separate files.
</p>
</div>

<div id="outline-container-org269bcc0" class="outline-3">
<h3 id="org269bcc0"><span class="section-number-3">2.1.</span> Submit a file that answers the following questions:</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>What is a terminal?</li>
<li>What shell is your version of Xubuntu using?</li>
<li>What is one other shell you might use?</li>
<li>Give two reasons (not more) why one might want to use the terminal.</li>
<li>I mentioned <code>ssh</code>. What does ssh stand for and how does it relate to the concept of a shell?</li>
</ol>
</div>
<div id="outline-container-org13c8ca6" class="outline-4">
<h4 id="org13c8ca6"><span class="section-number-4">2.1.1.</span> File Requirements</h4>
<div class="outline-text-4" id="text-2-1-1">
<ol class="org-ol">
<li>Make sure it has your name and student number on it.</li>
<li>Make sure it is in .org format. To do this you will want to, 
<ol class="org-ol">
<li>open Emacs.</li>
<li>open a new file</li>
<li><code>save as</code> (you can try <code>C-x C-s</code>) with a suitable name and the extension ".org".</li>
<li>Give each question its own heading (start the line with a single "*" and a following space).</li>
<li>Put your answer underneath this heading.</li>
<li>Save.</li>
<li>Upload to the "Terminal" dropbox on Learn.</li>
</ol></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org20d236a" class="outline-3">
<h3 id="org20d236a"><span class="section-number-3">2.2.</span> Submit a file that does the following:</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Can be run as a shell script.</li>
<li>Echos your name to the terminal.</li>
<li>Prints out the current directory.</li>
<li>Name this file as &lt;yourLastName&gt;_&lt;yourStudentNumber&gt;.sh</li>
<li>Upload to the "Terminal" dropbox on Learn.</li>
</ol>
</div>
</div>

<div id="outline-container-org53fad86" class="outline-3">
<h3 id="org53fad86"><span class="section-number-3">2.3.</span> Last Thoughts</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Enjoy the power the terminal provides, but don't go overboard. <a href="https://xkcd.com/196/">https://xkcd.com/196/</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-02-13 Mon 11:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>